'use strict';
var numberLesson = 1;
// Задания к уроку
// 1. Задать температуру в градусах по Цельсию. Вывести в alert соответствующую температуру в градусах по Фаренгейту. Подсказка: расчёт идёт по формуле: 
//Tf = (9 / 5) * Tc + 32, где Tf – температура по Фаренгейту, Tc – температура по Цельсию
// 2. Объявить две переменные: admin и name. Записать в name строку "Василий"; Скопировать значение из name в admin. Вывести admin (должно вывести «Василий»).
// 3. *Чему будет равно JS-выражение 1000 + "108"/
// 4. *Самостоятельно разобраться с атрибутами тега script (async и defer)

function numberTask(task) {

    switch (task) {
        case 1:
            taskOne();
            break;
        case 2:
            taskTwo();
            break;
        case 3:
            taskThree();
            break;
        case 4:
            taskFour();
            break;
        default:
            alert('До свидания!');
    }
}

function task() {
    let task = +prompt(`Доброго времени суток! Добро пожаловать на урок ${numberLesson}. Введите номер задания номер задания: 
        0. Выход.
        1. Задать температуру в градусах по Цельсию. Вывести в alert соответствующую температуру в градусах по Фаренгейту.
        2. Объявить две переменные: admin и name. Записать в name строку "Василий"; Скопировать значение из name в admin. Вывести admin (должно вывести «Василий»).
        3. *Чему будет равно JS-выражение 1000 + "108"
        4. *Самостоятельно разобраться с атрибутами тега script (async и defer)`);
    numberTask(task);
}

function taskOne() {
    let Tc = +prompt('Введите температуру в градусах Цельсия: ');
    let Tf = (9 / 5) * Tc + 32;
    alert(`Температура была конвертирована в градус Фаренгейта и равна: ${Tf}`);
    task();
}

function taskTwo() {
    let admin = '';
    let name = 'Василий';
    admin = name;
    alert(`admin - ${admin}`);
    task();
}

function taskThree() {
    alert('JS-выражение 1000 + "108" будет равно - 1000108');
    task();
}

function taskFour() {
    alert(`Атрибуты async и defer. 
    Оба атрибута работают только при наличии атрибута <src>!
    async - это ассинхронная загрузка скрипта, т.е. при обнаружении данного тега html код продолжает выполняться и вместе с этим загружается скрипт, после загрузки скрипта, происходит его выполнение.
    defer - это отложенное выполнение скрипта. При обнаружении данного тега html код продолжает выполняться и вместе с этим загружается скрипт, однако само выполнение скрипта происходит только после отработки html кода.`);
    task();
}

task();